{
    "name": "Shreyas Surendra",
    "tagline": "Software Engineer | MS Computer Science | UCF May 2021",
    "emailid": "shreyas.sf92@gmail.com",
    "phone": "+1 916-270-8480",
    "links": {
        "linkedin": "https://www.linkedin.com/in/shreyas-surendra-267601178/",
        "gitrepo": "https://github.com/shreyassf92"
    },
    "about": "/stest/ss",
    "timeline": [
        {
            "title": "Software Development Engineer – Intern",
            "org": "Advancing Technologies",
            "duration": "February 2021 – May 2021",
            "place": "Orlando, Florida",
            "description": "Create UI designs and develop screens for an android mobile application that provides performance analytics to athletes in combat sports.Design and implement database in MongoDB.Design and develop a serverless REST API backend on AWS using API Gateway and Lambda services"
        },
        {
            "title": "Information Technology Intern",
            "org": "FedEx Services",
            "duration": "August 2020 - November 2020",
            "place": "Collierville, Tennessee",
            "description": "Developed an automation workflow that fetches information of networking devices through REST API, performs extensive data validation, and updates the cleaned data into a centralized system; This supported the company’s transition to Software Defined Networks.Investigated performance issue and revamped the application to implement asynchronous design; enabled the program to run 12x faster.Developed an application that generates a report which shows the organization of ~160K networking devices in the FedEx data centers;The tool eliminated some of the manual tasks and assisted network engineers and data center capacity planners in their everyday activities.Participated in agile ceremonies and meetings with different stakeholders"
        },
        {
            "title": "Master's Degree, Computer Science",
            "org": "University of Central Florida",
            "duration": "August 2019 - May 2021",
            "place": "Orlando, Florida",
            "description": "Design and Analysis of Algorithms. Distributed Database Concepts. Advanced Computer Architecture. Machine Learninig. Natural Language Processing. Data Visualization Techniques"
        },
        {
            "title": "Software Engineer",
            "org": "Mphasis",
            "duration": "March 2015 - July 2019",
            "place": "Bengaluru, India",
            "description": "Designed and developed software components for a windows desktop application, FedEx Ship Manager, an end-to-end shipping application. Developed new features of the application that improved user experience, increased customer adoption and enabled product rationalization. Designed and developed a web application, an interface to the TFS version control web API; empowered the testing team to effortlessly track the data file changes in every new build and saved 2% of the team’s effort per day. Designed and developed a unit test execution tool to fit into the architecture that was employed; helped developers to test their code readily with its ability to isolate each test module’s execution environment and effortlessly owing to its user-friendly setup. Spearheaded a team of 3 for a unit testing project; achieved 70% code coverage and a significant improvement in software quality and build turnover time. Designed and developed an application to decrypt and display the content of an application data file used by multiple development and testing teams to analyze bugs; improved teams’ efficiency in detecting and fixing bugs. Worked on a Proof of Concept for developing a voice interface to the FedEx Tracking Web API using Alexa skill kit; presented the organization with a new opportunity to develop a voice driven app as an interface to tracking service. Awarded the summit award twice in a row for my contribution to the team and the organization’s innovation portal"
        },
        {
            "title": "Bachelor's Degree, Telecommunication Engineering",
            "org": "Visveswaraya Technological University",
            "duration": "August 2010 - July 2014",
            "place": "Bengaluru, India",
            "description": ""
        }
    ],
    "projects": [
        {
            "title": "Computer Architecture Simulation Application",
            "description": "Applied object-oriented programming concepts, design principles, design patterns to develop cache simulation, branch prediction & dynamic scheduling simulation tools in Java, under supervision of Dr. Yan Solihin.",
            "link": "https://github.com/shreyassf92"
        },
        {
            "title": "Sentiment Analysis of Customer Reviews",
            "description": "Applied text pre-processing methods and modeled a Naïve Bayes classifier as a baseline and developed more robust neural classification model using LSTM to classify a customer review into positive or negative.",
            "link": "https://github.com/shreyassf92"
        },
        {
            "title": "Visualization of US Non-Immigrant data",
            "description": "Developed a web based, interactive visualization using R and D3(Java Script) to visualize & analyze US non-immigrant data using bubble plot, population pyramid, donut chart and geo visualization(choropleth).",
            "link": "https://github.com/shreyassf92"
        },
        {
            "title": "Resume Builder",
            "description": "A SPA web application that organizes the resume into a rich UI using React.js. It features an open-close, timeline component that orders education and employment in a chronological order. And a carousel component that contains projects and its description.",
            "link": "https://github.com/shreyassf92"
        },
        {
            "title": "Geotab Intersection Congestion Prediction",
            "description": "Performed feature engineering and developed a ML regression model to predict traffic congestion in an intersection.",
            "link": "https://github.com/shreyassf92"
        }
    ]
}